[
    {
        "ticker": "JKHY",
        "company_name": "Jack Henry & Associates",
        "form": "10-K",
        "date": "2025-08-25",
        "report_path": "JKHY_10-K_ma_report.md",
        "sentiment": "** Passive",
        "findings": [],
        "potential_activity": [],
        "quotes": []
    },
    {
        "ticker": "TECH",
        "company_name": "Bio-Techne",
        "form": "10-K",
        "date": "2025-08-22",
        "report_path": "TECH_10-K_ma_report.md",
        "sentiment": "** Passive",
        "findings": [
            "No explicit mentions of mergers, acquisitions, divestitures, or strategic partnerships are present in the provided excerpt.",
            "The excerpt lacks discussions of market consolidation or competitive landscape changes that might indicate M&A motivation.",
            "The excerpt does not contain information about significant changes in cash position, debt, or capital allocation strategies that would suggest the company is actively preparing to fund an acquisition.",
            "There are no explicit \"Risk Factors\" sections mentioned in the provided excerpt related to M&A integration or deal completion.  The excerpt only provides the header and a snippet of XBRL data, which does not include the MD&A or risk factor disclosures."
        ],
        "potential_activity": [
            "Given the absence of information in the provided excerpt, it is impossible to speculate on potential future M&A activity. A full review of the entire 10-K filing, particularly the Management's Discussion and Analysis (MD&A) and Risk Factors sections, would be required to assess this."
        ],
        "quotes": [
            "None (The provided text excerpt is primarily XBRL tagging and lacks narrative content)."
        ]
    },
    {
        "ticker": "PH",
        "company_name": "Parker Hannifin",
        "form": "10-K",
        "date": "2025-08-22",
        "report_path": "PH_10-K_ma_report.md",
        "sentiment": "** Active (with past activity and potential for future activity)",
        "findings": [
            "The filing explicitly mentions the completion of the Meggitt Plc acquisition in 2022.",
            "The filing contains references to the integration and costs associated with the Meggitt Plc acquisition.",
            "Several divestitures of business units are mentioned as well.",
            "XBRL tags reveal the completed acquisitions of Meggitt PLC and Curtis Instruments Inc.  This data suggests a history of M&A activity."
        ],
        "potential_activity": [
            "While there are no explicit mentions of *future* acquisitions or mergers, Parker Hannifin's history of M&A activity, coupled with the ongoing integration of Meggitt Plc, suggests that additional strategic acquisitions could be pursued in the future. The company's financial resources and a history of focusing on growth suggest an openness to pursuing more M&A opportunities."
        ],
        "quotes": [
            "(Due to the nature of the provided data being primarily XBRL tags,  there are no textual quotes directly indicating M&A activity in the provided excerpt. The XBRL tags themselves constitute strong direct evidence of past M&A.)"
        ]
    }
]